import React from "react";
import MyMap from "./Components/MyMap/MyMap"; // Импортируйте компонент карты

const App = () => {
  // Пример массива точек с координатами
  const points = [
    { coords: [55.751574, 37.573856] }, // Москва, Красная площадь
    { coords: [55.7558, 37.6173] }, // Москва, Кремль
    { coords: [55.7602, 37.6184] }, // Москва, Большой театр
    { coords: [55.7621, 37.6056] }, // Москва, Патриаршие пруды
    { coords: [55.7522, 37.6156] }, // Москва, Манежная площадь
    { coords: [55.7497, 37.6325] }, // Москва, Лубянка
    { coords: [55.7532, 37.6211] }, // Москва, ЦУМ
    { coords: [55.7515, 37.6167] }, // Москва, Александровский сад
    { coords: [55.7648, 37.6206] }, // Москва, Китай-город
    { coords: [55.7553, 37.6206] }, // Москва, Зарядье
  ];

  return (
    <div>
      <h1>Пример использования API Яндекс.Карт</h1>
      <MyMap points={points} /> {/* Передаем массив точек в компонент карты */}
    </div>
  );
};

export default App;
